Revit 2027 API
BuiltInFailures.MassFailures.TooManyGeometries Property
 The geometry in this Mass instance is too complex to take advantage of the capabilities a Mass provides. Please break it down into multiple Mass and family instances that are less complex.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManyGeometries { get; }
Public Shared ReadOnly Property TooManyGeometries As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManyGeometries {
	FailureDefinitionId^ get ();
}
static member TooManyGeometries : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace